app/views/descuentos/_form.html.erb

<script type="text/javascript">
  $(document).ready(function() {
     <% @descuento.productos.each do |producto| %>
        var producto = new Object();
        producto.id = '<%= producto.id %>';
        producto.nombre = '<%= producto.nombre %>';
        producto.codigo = '<%= producto.codigo %>';
        <% producto.categorias.each do |cate| %>
          producto.categoria = '<%= cate.id %>';
          <% break %>
        <% end %>
        productos.push(producto);
      <% end %>
      <% @categorias.each do |c| %>
        $.ajax({
          url:  "/descuentos/total_producto",
          type: "POST",
          data: { categoria_id: '<%= c.id %>' },
          success: function(data){
            cont = 0;
            for(var k=0; k<productos.length; k++){
              if(productos[k].categoria == '<%= c.id %>'){
---
SELECT "categorias".* FROM "categorias"