app/views/terminales/_form.html.erb

<script type="text/javascript">
  $(document).ready(function() {
    $('#nueva_caja').hide();
    $("input[type=radio]").click(function(event){
      if(($(event.target).val())=='no'){
        $('#nueva_caja').hide();
        $('#seleccionar_caja').hide();
      }else{
        $("#terminal_cajas_registradora_id").prop('selectedIndex',0);
        $('#seleccionar_caja').show();
      }
    });

    $('#terminal_cajas_registradora_id').on('change', function(){
      if($("#terminal_cajas_registradora_id option:selected").text()=='Otra'){
        $('#nueva_caja').show();
      }
    });


    <% if @terminal.id.present? %>
      <% if @terminal.cajas_registradora_id.blank? %>
---
SELECT "cajas_registradoras".* FROM "cajas_registradoras"