app/views/terminales/index.html.erb

SELECT COUNT(*) FROM "inventarios"
---
<h4 class="text-center">Catálogo de Terminales</h4><br>
    <%if Inventario.all.size > 0 %>