app/views/proveedores/index.html.erb

INSERT INTO "proveedores" ("nombre", "contacto", "servicio", "rfc", "email", "telefono", "direccion", "ciudad", "estado", "codigo_Postal", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
---
  <br>
  <% @proveedores.create(nombre: "Proveedor",contacto: "", servicio: "General",rfc: "", email:"", telefono: "",direccion:"", ciudad:"", estado: "", codigo_Postal: "" ) %>