app/views/empleados/show.html.erb

SELECT  1 AS one FROM "usuarios" WHERE "usuarios"."empleado_id" = $1 LIMIT 1  [["empleado_id", 1]]
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."empleado_id" = $1  [["empleado_id", 1]]
---
			</br>
			<% if @empleado.usuarios.any? %>