app/views/productos/index.html.erb

                <%i=0 %>
                <% producto.categorias.each do |c| #función para tener la sintaxis correcta  %>
                  <% unless (i+1)==producto.categorias.length  %>
---
SELECT "categorias".* FROM "categorias" INNER JOIN "categorias_productos" ON "categorias"."id" = "categorias_productos"."categoria_id" WHERE "categorias_productos"."producto_id" = $1  [["producto_id", 1]]
SELECT COUNT(*) FROM "categorias"