app/views/productos/show.html.erb

SELECT  "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT 1  [["id", 1]]
---
                    <td>
                      <%= Producto.find(p.producto_id.to_i).nombre %>

SELECT "categorias".* FROM "categorias" INNER JOIN "categorias_productos" ON "categorias"."id" = "categorias_productos"."categoria_id" WHERE "categorias_productos"."producto_id" = $1  [["producto_id", 1]]
---
            <td>
              <% @producto.categorias.each do |c| %>