app/controllers/categorias_controller.rb

SELECT  "categorias".* FROM "categorias" WHERE "categorias"."nombre" = $1 LIMIT 1  [["nombre", "Electrónica"]]
INSERT INTO "categorias" ("nombre", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["nombre", "Electrónica"], ["created_at", "2018-10-19 22:04:41.611045"], ["updated_at", "2018-10-19 22:04:41.611045"]]
---
  def create
    @categoria = Categoria.new(paramsDeCategoria)
    if Categoria.find_by(nombre: params[:categoria][:nombre].strip).blank?
      if @categoria.save

SELECT "categorias".* FROM "categorias"
---
  def index
    @categorias = Categoria.all