app/controllers/descuentos_controller.rb

  def new
    @descuento = Descuento.new
    @categorias = Categoria.all
---
SELECT "categorias".* FROM "categorias"