app/controllers/empleados_controller.rb

SELECT "empleados".* FROM "empleados"
---
	def index
		@empleados = Empleado.all

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."empleado_id" = $1 LIMIT 1  [["empleado_id", 1]]
---
	def edit
		@roles = Rol.all
		@usuario = Usuario.find_by(empleado_id: params[:id])

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."usuario" = $1 LIMIT 1  [["usuario", "Victor"]]
INSERT INTO "empleados" ("nombre_completo", "apellido_paterno", "apellido_materno", "rfc", "fecha_nacimiento", "fecha_registro", "direccion", "ciudad", "estado", "codigo_postal", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"
INSERT INTO "usuarios" ("usuario", "email", "tipo", "contrasena_cifrado", "empleado_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
	def create
		@empleado = Empleado.new(empleado_params)
		if Usuario.find_by(usuario: params[:usuario][:usuario]).blank?
			@usuario = @empleado.usuarios.new(usuario_params)
			begin
				Empleado.transaction do
					@empleado.save

DELETE FROM "empleados" WHERE "empleados"."id" = $1  [["id", 1]]
---
	def destroy
	    @empleado.destroy

SELECT  "empleados".* FROM "empleados" WHERE "empleados"."id" = $1 LIMIT 1  [["id", nil]]
---
	def set_empleado
		@empleado = Empleado.find(params[:id])