app/controllers/empresas_controller.rb

SELECT  "empresas".* FROM "empresas"  ORDER BY "empresas"."id" ASC LIMIT 1
---
  def index
    @empresa = Empresa.first

INSERT INTO "empresas" ("nombre", "rfc", "iva", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nombre", "Departamental  Hay De Todo"], ["rfc", "RAD890706AY8"], ["iva", 16], ["created_at", "2018-10-19 22:46:52.617295"], ["updated_at", "2018-10-19 22:46:52.617295"]]
---
  def create
    @empresa = Empresa.new(empresa_params)
    if @empresa.save