app/controllers/inventarios_controller.rb

  def index
    @inventarios = Inventario.all.order :nombre
---
SELECT "inventarios".* FROM "inventarios"  ORDER BY "inventarios"."nombre" ASC

  def create
    @inventario = Inventario.new(inventario_params)
    if Inventario.find_by(nombre: params[:inventario][:nombre]).blank?
      if @inventario.save
---
SELECT  "inventarios".* FROM "inventarios" WHERE "inventarios"."nombre" = $1 LIMIT 1  [["nombre", "Inventario 1"]]
INSERT INTO "inventarios" ("nombre", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["nombre", "Inventario 1"], ["created_at", "2018-10-19 15:35:55.231364"], ["updated_at", "2018-10-19 15:35:55.231364"]]