app/controllers/permisos_controller.rb

SELECT "usuarios".* FROM "usuarios"
---
	def mod_usuarios
		@usuarios = Usuario.all