app/controllers/productos_controller.rb

  def new
    @productos = Categoria.first.productos.where("kit = false")
    @producto = Producto.new
    @categorias = Categoria.all
---
SELECT "productos".* FROM "productos" INNER JOIN "categorias_productos" ON "productos"."id" = "categorias_productos"."producto_id" WHERE "categorias_productos"."categoria_id" = $1 AND (kit = false)  [["categoria_id", 1]]
SELECT  "categorias".* FROM "categorias"  ORDER BY "categorias"."id" ASC LIMIT 1

  def create
    #flash[:success] = params[:productos_kit]
    @producto = Producto.new(paramsDeProducto)
    if @producto.save
---
INSERT INTO "productos" ("nombre", "definicion", "codigo", "lugar", "kit", "disponible_en_inventario", "unidad_id", "precio", "precio_costo", "iva", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def show
    @producto = Producto.find(params[:id])
---
SELECT  "productos".* FROM "productos" WHERE "productos"."id" = $1 LIMIT 1  [["id", 1]]